## Overview of Numeric Functions

Here are some of the numeric functions we might use quite often.

* `abs` - always return positive number
* `round` - rounds off to specified precision
* `ceil`, `floor` - always return integer.
* `greatest`
* `sum`, `avg`
* `min`, `max`
* `random`
* `pow`, `sqrt`

Some of the functions highlighted are aggregate functions, eg: `sum`, `avg`, `min`, `max` etc.

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
##database 
%env DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

env: DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

In [4]:
%%sql

SELECT abs(-10.5), abs(10)

1 rows affected.

[(Decimal('10.5'), 10)]

In [6]:
%sql select * from order_items limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99),
 (5, 4, 897, 2, 49.98, 24.99),
 (6, 4, 365, 5, 299.95, 59.99),
 (7, 4, 502, 3, 150.0, 50.0),
 (8, 4, 1014, 4, 199.92, 49.98),
 (9, 5, 957, 1, 299.98, 299.98),
 (10, 5, 365, 5, 299.95, 59.99)]

In [15]:
%%sql 

select sum(order_item_subtotal )as total , avg(order_item_subtotal) as average , 
round(sum(order_item_subtotal)) as rounded_total,round(avg(order_item_subtotal)) as rounded_average 
from order_items WHERE order_item_order_id = 2 limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(579.98, 193.32666666666668, 580.0, 193.0)]

In [16]:
%%sql

SELECT avg(order_item_subtotal) AS order_revenue_avg FROM order_items
WHERE order_item_order_id = 2

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(193.32666666666668,)]

In [28]:
%%sql 
select order_item_order_id , sum(order_item_subtotal) as order_revenue 
from order_items 
GROUP BY order_item_order_id 
ORDER BY order_item_order_id DESC
limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(68883, 2149.99),
 (68882, 109.99000000000001),
 (68881, 129.99),
 (68880, 999.77),
 (68879, 1259.97),
 (68878, 739.9300000000001),
 (68875, 2399.95),
 (68873, 859.9100000000001),
 (68871, 499.98),
 (68870, 479.91999999999996)]

In [164]:
%%sql

SELECT order_item_order_id, 
    sum(order_item_subtotal) AS order_revenue_sum
FROM order_items
GROUP BY order_item_order_id
ORDER BY order_item_order_id
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(1, 299.98),
 (2, 579.98),
 (4, 699.85),
 (5, 1129.8600000000001),
 (7, 579.9200000000001),
 (8, 729.8399999999999),
 (9, 599.96),
 (10, 651.9200000000001),
 (11, 919.79),
 (12, 1299.8700000000001)]

In [29]:
%%sql

SELECT
    round(10.58) rnd,
    floor(10.58) flr,
    ceil(10.58) cl

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(Decimal('11'), Decimal('10'), Decimal('11'))]

In [45]:
%%sql 
select order_item_subtotal from order_items limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(299.98,),
 (199.99,),
 (250.0,),
 (129.99,),
 (49.98,),
 (299.95,),
 (150.0,),
 (199.92,),
 (299.98,),
 (299.95,)]

In [46]:
%%sql 
select order_item_order_id,sum(order_item_subtotal) as order_revenue
from order_items 
GROUP BY order_item_order_id limit 10;

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, 299.98),
 (2, 579.98),
 (4, 699.85),
 (5, 1129.8600000000001),
 (7, 579.9200000000001),
 (8, 729.8399999999999),
 (9, 599.96),
 (10, 651.9200000000001),
 (11, 919.79),
 (12, 1299.8700000000001)]

In [52]:
%%sql 
select order_item_order_id,round(avg(order_item_subtotal)) as order_revenue_rounded
from order_items 
GROUP BY order_item_order_id limit 10;

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, 300.0),
 (2, 193.0),
 (4, 175.0),
 (5, 226.0),
 (7, 193.0),
 (8, 182.0),
 (9, 200.0),
 (10, 130.0),
 (11, 184.0),
 (12, 260.0)]

In [53]:
%%sql

SELECT round(avg(order_item_subtotal)::numeric,2) AS order_revenue_avg 
FROM order_items

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(Decimal('199.32'),)]

In [168]:
%%sql

SELECT order_item_order_id, 
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue_avg 
FROM order_items
GROUP BY order_item_order_id
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(1, Decimal('299.98')),
 (2, Decimal('579.98')),
 (4, Decimal('699.85')),
 (5, Decimal('1129.86')),
 (7, Decimal('579.92')),
 (8, Decimal('729.84')),
 (9, Decimal('599.96')),
 (10, Decimal('651.92')),
 (11, Decimal('919.79')),
 (12, Decimal('1299.87'))]

In [54]:
%%sql 
SELECT greatest(100,200,300)

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(300,)]

In [62]:
%%sql 
select max(order_item_subtotal) from order_items  limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(1999.99,)]

In [61]:
%%sql

SELECT greatest(10, 11, 10.5)

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(Decimal('11'),)]

In [68]:
%%sql 
SELECT 

order_item_order_id, max(order_item_subtotal) as max, 
round(sum(order_item_subtotal)) as sum , 
min(order_item_subtotal) as min 
from order_items  
GROUP BY order_item_order_id limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, 299.98, 300.0),
 (2, 250.0, 580.0),
 (4, 299.95, 700.0),
 (5, 299.98, 1130.0),
 (7, 299.98, 580.0),
 (8, 299.95, 730.0),
 (9, 199.99, 600.0),
 (10, 199.99, 652.0),
 (11, 399.96, 920.0),
 (12, 499.95, 1300.0)]

In [170]:
%%sql

SELECT order_item_order_id, 
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue_sum,
    min(order_item_subtotal) AS order_item_subtotal_min,
    max(order_item_subtotal) AS order_item_subtotal_max 
FROM order_items
GROUP BY order_item_order_id
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(1, Decimal('299.98'), 299.98, 299.98),
 (2, Decimal('579.98'), 129.99, 250.0),
 (4, Decimal('699.85'), 49.98, 299.95),
 (5, Decimal('1129.86'), 99.96, 299.98),
 (7, Decimal('579.92'), 79.95, 299.98),
 (8, Decimal('729.84'), 50.0, 299.95),
 (9, Decimal('599.96'), 199.98, 199.99),
 (10, Decimal('651.92'), 21.99, 199.99),
 (11, Decimal('919.79'), 49.98, 399.96),
 (12, Decimal('1299.87'), 100.0, 499.95)]

In [171]:
%sql SELECT random()

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(0.03222073158160299,)]

In [172]:
%sql SELECT (random() * 100)::int + 1

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(98,)]

In [173]:
%sql SELECT pow(2, 2)::int, sqrt(4)

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(4, 2.0)]